<?php
/////////////////////////////////////////////////////////////////////////
//
// @ 1~100 까지 소수 구하기
//
// @ 소수란...?
//
// @ 1 과 자기 자신만으로 나누어 떨어지는 자연수
//
/////////////////////////////////////////////////////////////////////////
 
 
  
for($num_1 = 1 ; $num_1 <= 100 ; $num_1 ++)
{
    $check = "ok";
  
    for($num_2 = 2 ; $num_2 < $num_1 ; $num_2 ++)
    {
        if($num_1 % $num_2 == 0)
        {
 
             $check = "no";
 
        }// end if
  
    }// end for
  
    if($check == "ok")
    {
 
        echo "[".$num_1."]은 소수 입니다<br />";
 
    }// end if
  
}// end for
  
?>


출처: https://qnfmfmd.tistory.com/40?category=611713 [은랑이의 세상살아가는 이야기~]

출처: https://qnfmfmd.tistory.com/40?category=611713 [은랑이의 세상살아가는 이야기~]
